<?php

return [
    // response messages
    'LOGIN' => 'تم تسجيل الدخول بنجاح',
    'LOGIN_FAILED' => 'البيانات المدخلة غير صحيحة',
    'REGISTER' => 'تم تسجيل الحساب بنجاح',
    'USER_CREATED_SUCCESSFULLY' => 'تم إنشاء المستخدم بنجاح',
    'USER_UPDATED_SUCCESSFULLY' => 'تم تحديث المستخدم بنجاح',
    'USER_DELETED_SUCCESSFULLY' => 'تم حذف المستخدم بنجاح',
    'SETTINGS_UPDATED_SUCCESSFULLY' => 'تم تحديث الإعدادات بنجاح',
    'USER_NOT_FOUND' => 'المستخدم غير موجود',
    'ACCOUNT_NOT_ACTIVE' => 'الحساب غير مفعل',
    'LANGUAGE_CHANGED_SUCCESSFULLY' => 'تم تغيير اللغة بنجاح',
    'ACTION_FORBIDDEN' => 'هذا الإجراء محظور',


    // Constants
    'ID' => 'الرقم التسلسلي',
    'LOGIN_TITLE' => 'تسجيل الدخول',
    'REGISTER_TITLE' => 'تسجيل حساب جديد',
    'LOGIN_WELCOME_MESSAGE' => 'مرحبا بك في لوحة التحكم 👋',
    'REMEMBER_ME' => ' تذكرني',
    'LOGIN_BUTTON' => 'تسجيل الدخول',
    'PASSWORD' => 'كلمة المرور',
    'EMAIL' => 'البريد الإلكتروني',
    'EMAIL_PLACEHOLDER' => 'john@example.com',
    'EMAIL_OR_USERNAME' => 'البريد الإلكتروني أو اسم المستخدم',
    'USERNMAE' => 'اسم المستخدم',
    'WELCOME_BACK' => 'مرحبا بعودتك! 👋',
    'WEBSITE_TITLE' => 'نظام إدارة الإجازات الداخلية',
    'LATEST_STATUS_DATE' => 'تاريخ-آخر-تحديث',
    'SOMETHING_WENT_WRONG' => 'حدث خطأ ما',
    'ADDITIONAL_INFORMATION' => 'معلومات إضافية',
    'LANGUAGE' => 'اللغة',
    'ENGLISH' => 'الإنجليزية',
    'ARABIC' => 'العربية',

    //SideBar
    'TITLE' => 'لوحة التحكم',
    'DASHBOARD' => 'الرئيسية',
    'USERS' => 'المستخدمين',
    'SETTINGS' => 'الإعدادات',
    'LOGOUT' => 'تسجيل الخروج',

    // Users roles
    config('settings.roles.names.adminRole') => 'مدير',
    config('settings.roles.names.employeeRole') => 'موظف',


    // STATUS
    'ACTIVE' => ' مفعل ',
    'UNACTIVE' => 'غير مفعل',


    //Dashboard
    'ACTIVE_USERS' => 'المستخدمين المفعلين',
    'UNACTIVE_USERS' => 'المستخدمين غير المفعلين',
    'USERS_TOTAL' => 'إجمالي المستخدمين',
    'ADD_USER' => 'إضافة مستخدم',
    'UPDATE_USER' => 'تحديث مستخدم',
    'STATUS_DATE' => 'تاريخ الحالة',
    'EMPLOYEES_COUNT' => 'عدد الموظفين',
    'TOTAL_REQUESTS' => 'إجمالي الطلبات',
    'APPROVED_REQUESTS' => 'طلبات الموافقة',
    'PENDING_REQUESTS' => 'طلبات قيد الانتظار',
    'REJECTED_REQUESTS' => 'طلبات الرفض',





    // Buttons
    'CREATE' => 'إنشاء',
    'EDIT' => 'تعديل',
    'DELETE' => 'حذف',
    'SAVE' => 'حفظ',
    'CANCEL' => 'إلغاء',

    // user inputs
    'FIRST_NAME' => 'الاسم الأول',
    'LAST_NAME' => 'الاسم الأخير',
    'USERNAME' => 'اسم المستخدم',
    'EMAIL' => 'البريد الإلكتروني',
    'PASSWORD' => 'كلمة المرور',
    'PASSWORD_CONFIRMATION' => 'تأكيد كلمة المرور',
    'PHONE' => 'رقم الهاتف',
    'STATUS' => 'الحالة',
    'ROLE' => 'المنصب',
    'PERMISSIONS' => 'الصلاحيات',
    'SELECT_ROLE' => 'اختر المنصب',


    //leave requests
    'LEAVE_REQUESTS' => 'طلبات الإجازة',
    'USER' => 'المستخدم',
    'START_DATE' => 'تاريخ البداية',
    'END_DATE' => 'تاريخ الانتهاء',
    'REASON' => 'السبب',
    'STATUS' => 'الحالة',
    'NOTE' => 'ملاحظة',
    'CREATED_AT' => 'تاريخ الإنشاء',
    'REQUESTED_AT' => 'تاريخ الطلب',
    'NEW_LEAVE_REQUEST' => 'طلب إجازة جديدة',
    'ADD_LEAVE_REQUEST' => 'إضافة طلب',
    'UPDATE_LEAVE_REQUEST' => 'تحديث الطلب',
    'LEAVE_REQUEST_CREATED_SUCCESSFULLY' => 'تم إنشاء طلب الإجازة بنجاح',
    'LEAVE_REQUEST_UPDATED_SUCCESSFULLY' => 'تم تحديث طلب الإجازة بنجاح',
    'LEAVE_REQUEST_DELETED_SUCCESSFULLY' => 'تم حذف طلب الإجازة بنجاح',


    // LEAVE REQUEST status
    'REQUESTED' => 'طلب إجازة',
    'APPROVED' => 'موافقة',
    'REJECTED' => 'رفض',

    'ARE_YOU_SURE' => 'هل أنت متأكد؟',
    'YOU_CAN_NOT_REVERT' => 'لا يمكنك التراجع عن هذا!',
    'YES_DELETE' => 'نعم، احذفها!',
    'NO_CANCEL' => 'لا ، إلغاء!',

];
